import React from "react";
import "./SlideLast.css";

function SlideThird() {
    return (
        <div className="slide-third-container">
            <div className="box">
                <div className="title">상세 진로 분류</div>
                <div className="content">
                    - IT기반 플랫폼 기업: B2C 서비스를 위한 플랫폼을 개발 및 운영 (e.g., 네이버, 카카오, 비바리퍼블리카, 우아한형제들 등)<br />
                    - B2B 솔루션 기업: 타 기업에 판매하기 위한 소프트웨어 솔루션을 개발하고 판매한 솔루션의 설치 및 유지보수를 담당 (e.g., 티맥스소프트, 안랩 등)<br />
                    - 모바일/PC 게임 기업: 온라인 게임의 개발 및 운영 (e.g., 엔씨소프트, 넷마블, 넥슨, 크래프톤 등)<br />
                    - 비IT기업의 IT부서(전산직): 금융/제조 등 다양한 회사의 전산직군으로 입사하여, 해당 회사의 IT 시스템을 개발 및 운영 (e.g., 삼성전자, LG전자, KB국민은행, 현대자동차 등)<br />
                    - SI/SM (System Integration/System Maintenance) 기업: 비IT기업으로부터 외주 받은 IT 시스템을 개발/운영/유지보수 (e.g., 삼성 SDS, LG CNS, SK C&C 등)<br />
                    - 스타트업: IT 관련 벤처에 취업 또는 창업<br />
                    - 공공기관: 공익을 목적으로 하는 기관에 전산직으로 입사하여 시스템 개발 및 운영 (한국은행, 금융결제원, 한국산업은행, 금융보안원 등)<br />
                    - 연구소: 국책 연구기관이나 기업 산하 연구소에서 컴퓨터 관련 연구개발을 수행 (e.g., 한국전자통신연구원 등)<br />
                    - 교사: 교직과정 이수 후 중고등학교에서 컴퓨터, 정보 분야 교과목 교육<br />
                    - 전산직 공무원: 공개채용 과정을 거쳐 9급/7급 전산직 공무원으로 입사 후, 전산개발/정보보호 관련 기술/행정 업무 전반 담당<br />
                    - 변리사: 변리사 자격 시험 합격 후, 컴퓨터공학 관련 분야의 특허업무 수행<br />
                    - 대학원 진학 및 해외 유학: 국내외 컴퓨터공학 관련 대학원에 진학하여 인공지능이나 보안 등 첨단 분야 석사, 박사 학위 취득 (성신여자대학교 대학원 컴퓨터학과)<br />
                </div>
            </div>
        </div>
    );
}

export default SlideThird;